insert into s10p12c205.guild (guild_id, name, image, introduction, capacity, disbanded_at, language, difficulty, problem_capacity, created_at, updated_at)
values  (1, '장덕동 프리라이더', '/images/code_odyssey/ProblemSolveBg.svg', '같이 열심히 해봐용~ ', 3, null, 'JAVA', 13, 3, '2024-02-15 00:32:02', '2024-02-16 00:32:07'),
        (2, '투게더', '/images/code_odyssey/ProblemSolveBg.svg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어진 주제에 대해 사전에 학습하고 와야 합니다.
3. 모든 참여자는 스터디 진행에 적극적으로 참여해야 합니다.
4. 풀지 못한 문제에 대해 서로 도와주고 지원합니다.
5. 코드 리뷰와 피드백에 대한 존중과 신뢰를 유지합니다.
6. 적극적인 소통과 긍정적인 피드백 문화를 유지합니다.
7. 비방이나 인신공격은 엄격히 금지됩니다.
8. 스터디 참여자들은 서로를 존중하고 배려합니다.', 10, null, 'JAVA', 21, 3, '2024-02-15 00:50:32', '2024-02-15 03:08:44'),
        (3, '수린''s House', '/images/code_odyssey/ProblemSolveBg.svg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어진 주제에 대해 사전에 학습하고 와야 합니다.
3. 모든 참여자는 스터디 진행에 적극적으로 참여해야 합니다.
4. 풀지 못한 문제에 대해 서로 도와주고 지원합니다.
5. 코드 리뷰와 피드백에 대한 존중과 신뢰를 유지합니다.
6. 적극적인 소통과 긍정적인 피드백 문화를 유지합니다.
7. 비방이나 인신공격은 엄격히 금지됩니다.
8. 스터디 참여자들은 서로를 존중하고 배려합니다.', 10, null, 'JAVA', 7, 2, '2024-02-15 01:55:58', '2024-02-16 00:33:39'),
        (4, '옹뎅생잉', 'https://firebasestorage.googleapis.com/v0/b/react-code-odyssey.appspot.com/o/firebase%2Fprofile.jpeg?alt=media&token=e3541fd8-6588-4ad1-962d-6b8bc216fc11', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어진 주제에 대해 사전에 학습하고 와야 합니다.
3. 모든 참여자는 스터디 진행에 적극적으로 참여해야 합니다.
4. 풀지 못한 문제에 대해 서로 도와주고 지원합니다.
5. 코드 리뷰와 피드백에 대한 존중과 신뢰를 유지합니다.
6. 적극적인 소통과 긍정적인 피드백 문화를 유지합니다.
7. 비방이나 인신공격은 엄격히 금지됩니다.
8. 스터디 참여자들은 서로를 존중하고 배려합니다.', 9, null, 'PYTHON', 11, 1, '2024-02-15 01:59:44', '2024-02-15 21:44:01'),
        (5, '코드마스터', 'https://marketplace.canva.com/EAD2xI0GoM0/1/0/1600w/canva-%ED%95%98%EB%8A%98-%EC%95%BC%EC%99%B8-%EC%9E%90%EC%97%B0-%EC%98%81%EA%B0%90-%EC%9D%B8%EC%9A%A9%EB%AC%B8-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4-rssvAb9JL4I.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어진 주제에 대해 사전에 학습하고 와야 합니다.
3. 모든 참여자는 스터디 진행에 적극적으로 참여해야 합니다.
4. 풀지 못한 문제에 대해 서로 도와주고 지원합니다.
5. 코드 리뷰와 피드백에 대한 존중과 신뢰를 유지합니다.
6. 적극적인 소통과 긍정적인 피드백 문화를 유지합니다.
7. 비방이나 인신공격은 엄격히 금지됩니다.
8. 스터디 참여자들은 서로를 존중하고 배려합니다.', 4, null, 'CPP', 12, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (6, '알고닉', 'https://icepipeled.com/wp-content/uploads/2020/03/1.-ICEPIPE_2020_4_PC_bg.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어진 주제에 대해 사전에 학습하고 와야 합니다.
3. 모든 참여자는 스터디 진행에 적극적으로 참여해야 합니다.
4. 풀지 못한 문제에 대해 서로 도와주고 지원합니다.
5. 코드 리뷰와 피드백에 대한 존중과 신뢰를 유지합니다.
6. 적극적인 소통과 긍정적인 피드백 문화를 유지합니다.
7. 비방이나 인신공격은 엄격히 금지됩니다.
8. 스터디 참여자들은 서로를 존중하고 배려합니다.', 5, null, 'JAVA', 13, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (7, '문해', 'https://mblogthumb-phinf.pstatic.net/MjAxODA3MTNfMjE2/MDAxNTMxNDcwNjc0NzYx.W4NCVBUQ93YNksizyvGXZxnmLvmhANMRoN_7Jl6uPVQg.tGE8Ggfkw1l_DM75WwosWzmaWjSMiZ9tgjOWOcO1fyEg.JPEG.bemine9_9/pastelsky9.jpg?type=w800', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'PYTHON', 1, 3, '2024-02-15 02:22:35', '2024-02-15 02:26:07'),
        (8, '프로코딩', 'https://marketplace.canva.com/EAD2xKFMzyE/1/0/1600w/canva-%EB%AF%B8%EA%B5%AD-%EC%9B%90%EC%A3%BC%EB%AF%BC-%EC%86%8D%EB%8B%B4-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4-ZkWHzr_qX0k.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'CPP', 4, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (9, '코드킹', 'https://i.pinimg.com/originals/b5/f5/ac/b5f5aca4c3958e2b8a3424ed11bb2dff.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'JAVA', 3, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (10, '문제랩', 'https://mblogthumb-phinf.pstatic.net/MjAyMDAzMTVfMjY0/MDAxNTg0MjU5ODgyNTQ5.Uwz1guxMV9SVXLW7iDEDmtlbVstumgn84AeSu42rjyMg.WcCNq2ZO5hFqcV8y9RbyiBNCW0TNSXAZk5co7rpnv7Qg.JPEG.se___ovo/%EC%BB%B4%ED%93%A8%ED%84%B0%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4%EC%9E%90%EC%97%B002.jpg?type=w800', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'PYTHON', 8, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (11, '알코딩', 'https://marketplace.canva.com/EAD2vH7QoTo/1/0/1600w/canva-%EB%B3%84%EC%9D%B4-%EB%B9%9B%EB%82%98%EB%8A%94-%ED%95%98%EB%8A%98-%EA%B2%A8%EC%9A%B8-%EC%82%AC%EC%A7%84-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4-940n7WeDIe4.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 10, null, 'CPP', 21, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (12, '스터디즈', 'https://img1.daumcdn.net/thumb/R1280x0.fjpg/?fname=http://t1.daumcdn.net/brunch/service/user/8LOK/image/Kx3PTA8nv2pHelBbVxvavOi0lK0.JPG', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 3, null, 'JAVA', 17, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (13, '알골레', 'https://cdn.imweb.me/upload/S20200130a3018554a5004/dcaf176569836.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 4, null, 'PYTHON', 15, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (14, '코마스', 'https://mblogthumb-phinf.pstatic.net/MjAxNzA3MjNfNDUg/MDAxNTAwNzk1Mjg5NjYz.luYmZsoLIRRHss1nHemnIc0l3ZqbJlUkA7rUyVh77uwg.I5GQet-u8sWnztF65KyNqB-xrALeAujtPtgFnzfGkAsg.PNG.badpark/1920x1080-004.png?type=w800', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 5, null, 'CPP', 12, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (15, '코드킹스', 'https://icepipeled.com/wp-content/uploads/2020/11/ICEPIPE_2020_11_PC-bg.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'JAVA', 1, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (16, '알고스터디', 'https://help.miricanvas.com/hc/article_attachments/900001079443/______________1_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'PYTHON', 5, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (17, '코드그루', 'https://i.pinimg.com/550x/90/14/2e/90142eb0b2ed44bd694ffc3a25df805b.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'CPP', 2, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (18, '알고리드', 'https://cdn.imweb.me/upload/S2017100759d8411403950/5a93b06712f90.jpg', '**알고리즘 스터디**
알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.
**알고리즘 스터디 규칙**
1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'JAVA', 8, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (19, '코딩마스터', 'https://img2.quasarzone.com/editor/2022/04/08/ecbd2b60ec7ea4b44cbdbfeee980b8c9.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 4, null, 'PYTHON', 9, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (20, '알고봇', 'https://marketplace.canva.com/EAD2vdKwTrk/1/0/1600w/canva-%EB%B6%93-%EA%B8%80%EC%94%A8-%EB%B0%A4-%ED%95%98%EB%8A%98-%EC%9E%90%EC%97%B0-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4-WxuqI-kF_FY.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 5, null, 'CPP', 13, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (21, '코딩랩', 'https://img.freepik.com/free-photo/natures-beauty-reflected-in-tranquil-mountain-waters-generative-ai_188544-7867.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'JAVA', 15, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (22, '문제즈', 'https://png.pngtree.com/thumb_back/fw800/background/20230113/pngtree-hand-painted-illustration-whale-computer-tablet-wallpaper-image_1514863.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'PYTHON', 14, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (23, '코알리', 'https://blog.kakaocdn.net/dn/chbbw8/btsiaZo3tu4/Mja378plbFqKoKQKPghdMk/img.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'CPP', 12, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (24, '코드마스터스', 'https://c.wallhere.com/photos/79/d1/1920x1080_px_Blue_Background_clouds_digital_art_Falling_Glowing_lines_Moon-570886.jpg!d', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'JAVA', 5, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (25, '알고노트', 'https://help.miricanvas.com/hc/article_attachments/900001069806/______________5_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 5, null, 'PYTHON', 3, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (26, '문제마스터', 'https://lh3.googleusercontent.com/proxy/0UJ6l1-2gF26vQvfQz7Bgvn8evBeHzYgn9Pbfrox7PWzoXUI6oZ9iLLTt6moUeN-tDIvWIKFyVZETXPZAEqKkhd1a4oC8RhNdmYhzlt4e-7Fk9iDd5PNyJyCoM1hYzhW1Yx_U7qcaMTXYlPshfJElNqvM5Q', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'CPP', 2, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (27, '코딩메이트', 'https://blog.kakaocdn.net/dn/lhyZe/btqDwdVueRq/m9hTtpkh6V4nord8rpVDv0/img.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'JAVA', 7, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (28, '알스터디', 'https://p4.wallpaperbetter.com/wallpaper/424/586/377/sky-4k-hd-high-definition-wallpaper-preview.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'PYTHON', 9, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (29, '코드애널리틱', 'https://i.imgur.com/0caFtNp.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'CPP', 23, 3, '2024-02-15 02:22:35', '2024-02-15 02:22:35'),
        (30, '알고닷컴', 'https://help.miricanvas.com/hc/article_attachments/900001079423/______________2_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 3, null, 'JAVA', 25, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (31, '코드노트', 'https://blog.kakaocdn.net/dn/OMvSp/btr2C8IUGBe/K58RatIJgEuanbELkyPDkk/img.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 4, null, 'PYTHON', 24, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (32, '알고퍼즐', 'https://cdn.pixabay.com/photo/2017/08/30/01/05/milky-way-2695569_640.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 5, null, 'CPP', 22, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (33, '문제리더', 'https://blog.kakaocdn.net/dn/JS8Xx/btqZPGIMpzj/1gmeDxxJTX1OkLHq6OcGP0/img.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'JAVA', 20, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (34, '코딩메이커', 'https://png.pngtree.com/thumb_back/fw800/background/20231007/pngtree-d-render-concept-dark-room-home-office-with-desktop-icons-in-image_13595047.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'PYTHON', 15, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (35, '코드리더', 'https://photo.coolenjoy.co.kr/data/editor/1907/thumb-Bimg_221fc91c051fdd33617ea6de3d7f0c02_osbc.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'CPP', 14, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (36, '알고문제', 'https://blog.kakaocdn.net/dn/EHQsJ/btrg6viZDj5/7nkqw4e5mWn8JhRDJgEV91/windows_shwastudio_autumn_cat_black.jpg?attach=1&knm=img.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'JAVA', 13, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (37, '문제앤코드', 'https://i.pinimg.com/474x/5c/0b/e5/5c0be53a760b3dc9a43d77deadc3ebe2.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 10, null, 'PYTHON', 17, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (38, '코딩메카', 'https://help.miricanvas.com/hc/article_attachments/900001079523/______________7_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 3, null, 'CPP', 18, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (39, '코드파워', 'https://m.himolly.co.kr/web/upload/NNEditor/20200928/copy-1601277167-ED9994EC9DB4ED8AB8EB9E98EBB997_ECBBB4EBB0B0EAB2BD.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 4, null, 'JAVA', 20, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (40, '알고라운드', 'https://i.pinimg.com/474x/3c/c0/34/3cc03453f769a22170f7c0a8070418f8.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 5, null, 'PYTHON', 19, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (41, '문제프로', 'https://marketplace.canva.com/EAD2vXTcxow/1/0/1600w/canva-%ED%9D%B0%EC%83%89-%EB%B0%8F-%EC%A7%99%EC%9D%80-%EC%A3%BC%ED%99%A9%EC%83%89-%EA%BD%83-%EA%BD%83%EB%AC%B4%EB%8A%AC-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4-fgofHzH4t44.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'CPP', 5, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (42, '코딩버디', 'https://help.miricanvas.com/hc/article_attachments/900001069926/______________17_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'JAVA', 6, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (43, '코드스쿨', 'https://png.pngtree.com/thumb_back/fw800/background/20210902/pngtree-computer-desktop-fresh-wallpaper-image_790450.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'PYTHON', 9, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (44, '알고톡', 'https://help.miricanvas.com/hc/article_attachments/900002313983/_________9_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'CPP', 8, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (45, '문제해결', 'https://p4.wallpaperbetter.com/wallpaper/905/738/430/astronaut-4k-computer-background-wallpaper-preview.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 10, null, 'JAVA', 4, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (46, '코딩네트워크', 'https://marketplace.canva.com/EAD2vJNsnjA/1/0/1600w/canva-%EC%B4%88%EB%A1%9D%EC%83%89-%ED%8C%8C%EC%9D%B8%EC%95%A0%ED%94%8C-%EC%97%B4%EB%8C%80-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4-XRLMcMcaO84.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 3, null, 'PYTHON', 7, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (47, '코드블록', 'https://p4.wallpaperbetter.com/wallpaper/816/141/89/gundam-versus-high-definition-wallpaper-preview.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 4, null, 'CPP', 12, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (48, '알고네트워크', 'https://e0.pxfuel.com/wallpapers/896/81/desktop-wallpaper-cute-funny-for-computer.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 5, null, 'JAVA', 14, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (49, '문제챌린지', 'https://e0.pxfuel.com/wallpapers/170/889/desktop-wallpaper-computer-top-computer-background-3840-x-2160.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'PYTHON', 11, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (50, '코딩매트릭스', 'https://png.pngtree.com/thumb_back/fw800/background/20230611/pngtree-wolf-animals-images-wallpaper-for-pc-384x480-image_2916211.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 7, null, 'CPP', 15, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (51, '코드워리어', 'https://i.pinimg.com/1200x/e1/1f/75/e11f75f9867b62a1e083f46306037d32.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 8, null, 'JAVA', 12, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (52, '알고스쿨', 'https://marketplace.canva.com/EAD2vT_uRzs/1/0/1600w/canva-%EA%B2%8C%EC%9C%BC%EB%A6%84%EB%B1%85%EC%9D%B4-%EC%9E%AC%EB%AF%B8-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%86%B1-%EB%B0%B0%EA%B2%BD%ED%99%94%EB%A9%B4--qQT1VVYmOk.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 10, null, 'PYTHON', 13, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (53, '문제워크', 'https://i.pinimg.com/originals/06/f2/6f/06f26fec6fffa958dcef432935d5d449.jpg', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 9, null, 'CPP', 7, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (54, '코드퍼즐', 'https://help.miricanvas.com/hc/article_attachments/900001069906/______________15_.png', '**알고리즘 스터디**

알고리즘 스터디는 프로그래밍의 핵심인 알고리즘과 자료구조에 대한 심도 있는 이해를 목표로 하는 스터디입니다. 우리는 매주 주어지는 주제를 토대로 이론 공부와 함께 다양한 실전 문제를 해결하며 프로그래밍 실력을 향상시킵니다. 스터디는 초보자부터 전문가까지 누구나 참여할 수 있으며, 함께 성장하고 배우는 커뮤니티를 형성합니다.

**알고리즘 스터디 규칙**

1. 매주 정기적으로 스터디가 진행됩니다.
2. 스터디 참여자는 매주 주어', 6, null, 'JAVA', 8, 3, '2024-02-15 02:22:36', '2024-02-15 02:22:36'),
        (55, '영훈이네', '/images/code_odyssey/ProblemSolveBg.svg', '삼성 소프트웨어 역량 평가 A+ 고영훈과 함께하는 알고리즘 대탐험', 2, null, 'PYTHON', 26, 1, '2024-02-15 11:56:56', '2024-02-15 02:58:44'),
        (56, '범수네', 'https://firebasestorage.googleapis.com/v0/b/react-code-odyssey.appspot.com/o/firebase%2F%EA%B0%80%EB%AC%BC%EC%B9%98.jpg?alt=media&token=63cc19dc-202a-4f61-9728-fc520f805588', '안녕하세요! 같이 공부해요', 4, null, 'JAVA', 6, 3, '2024-02-15 15:07:37', '2024-02-15 15:07:37'),
        (57, '주현이네', '/images/code_odyssey/ProblemSolveBg.svg', '안녕하세요', 10, null, 'JAVA', 9, 3, '2024-02-15 15:08:42', '2024-02-15 21:27:28'),
        (58, '안아줘요의문단속', 'https://firebasestorage.googleapis.com/v0/b/react-code-odyssey.appspot.com/o/firebase%2F%EC%BA%A1%EC%B2%98.PNG?alt=media&token=d6b37ef9-64e7-498b-8be8-961229cfbcfd', '## 스프린트 진행 기간
- 매 주 회고 시 결정
- 기본 7일 진행 예정

## 문제 난이도
- 매 주 회고 시 결정
- 기본 골드 예상

## 이런 분 환영합니다!
- 알고리즘 자신 없지만, 열심히 할 자신 있다!
- 회의, 코드리뷰 적극 참여할 분
', 10, null, 'PYTHON', 13, 2, '2024-02-15 16:06:42', '2024-02-16 00:06:32'),
        (61, '광주2반C205', 'https://firebasestorage.googleapis.com/v0/b/react-code-odyssey.appspot.com/o/firebase%2Fthumbnail.png?alt=media&token=2d5ec939-c8dd-4b65-aff3-5b3f5b360a4e', '# 환영
열심히 할분만 오세요', 10, null, 'JAVA', 13, 3, '2024-02-15 22:51:43', '2024-02-16 00:19:10'),
        (62, '댕댕이 귀여워', 'https://firebasestorage.googleapis.com/v0/b/react-code-odyssey.appspot.com/o/firebase%2FKakaoTalk_20240112_235428923.jpg?alt=media&token=39c2159a-7020-4217-a212-cace735ef6f4', '귀여운 댕댕이를 보며 알고리즘을!', 10, null, 'JAVA', 1, 1, '2024-02-15 22:58:00', '2024-02-15 22:58:00'),
        (63, 'odyssey', 'https://firebasestorage.googleapis.com/v0/b/react-code-odyssey.appspot.com/o/firebase%2Faf5108e9beff492394380d04b62b1661_1622348282.jpg?alt=media&token=daee1f15-1ab0-4b67-85e9-d6e75df47552', 'test', 9, null, 'JAVA', 11, 1, '2024-02-15 23:50:21', '2024-02-15 23:50:21'),
        (64, '열알고', '/images/code_odyssey/ProblemSolveBg.svg', '열심히 알고리즘 푸실 분 구해요 ~', 2, null, 'PYTHON', 1, 1, '2024-02-15 23:51:35', '2024-02-15 23:51:35');